{
  "avatarInitial": "V",
  "bio": "A creative and problem-solving software engineer passionate about professional and personal growth. I thrive on solving complex challenges, continuously learning, and contributing to innovative and collaborative projects that drive meaningful advancements in Information Technology.",
  "funFact": {
    "text": "I once deployed a full app in under 24 hours and it's still running in production today!"
  },
  "keyTraits": ["Teamwork", "Logical Thinking", "Critical Thinking"],
  "journey": {
    "milestones": [
      {
        "year": "2024",
        "title": "AI Engineer at VMO Holdings",
        "description": "Provided AI solutions for various services, including using latest LLM and advanced techniques to meet customer needs.",
        "icon": "Building2"
      },
      {
        "year": "2023",
        "title": "Natural Language Processing Engineer at The Institute of Big Data (VinBigdata)",
        "description": "Conducted research in information retrieval to enhance search algorithms, improving search functionality.",
        "icon": "Building2"
      },
      {
        "year": "2023",
        "title": "Lecturer at MindX Technology School",
        "description": "Specialized in teaching programming courses to kids such as Scratch, Game Programming, and Python.",
        "icon": "BookOpen"
      },
      {
        "year": "2022",
        "title": "Teaching Assistant at Hanoi University of Science and Technology",
        "description": "Supported instructors in delivering lectures for Database and Techniques of Programming courses at Hanoi University of Science and Technology.",
        "icon": "BookOpen"
      }
    ]
  },
  "education": [
    {
      "year": "2020 - 2025",
      "degree": "Bachelor of Engineering in Computer Engineering",
      "institution": "Hanoi University of Science and Technology",
      "description": "Focused on software development, algorithms, and data structures. Completed a final year project on natural language processing."
    }
  ]
}
